wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code_ori/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
		}		
}	

/**@brief Function for initializing 
 */
static void modules_init(void)
{		
   //buffer_init();
	 sensor_simulator_init();
   power_management_init();

	 
	if(m_protocol_mode == M_COMS_BLE_MODE)
	{	
     m_coms_ble_init(m_coms_ble_evt_handler);
  }
  else
	{	
	  clock_start();
	  m_coms_gzll_init(m_coms_gzll_evt_handler);
		
	}	

}	


static void modules_enable(bool erase_bonds)
{

  if(m_protocol_mode == M_COMS_BLE_MODE)
	{	
	
		m_coms_ble_enable(erase_bonds);
		 NRF_LOG_INFO("BLE mode start.");
	}	
	else
	{				
	   m_coms_gzll_enable(erase_bonds);
		 m_coms_gzll_search_for_host();
     NRF_LOG_INFO("GZLL mode start.");		
	}	
		
}

static void protocol_det_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	uint8_t level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
	uint8_t is_softdevice_enabled;
	
  if (pin == PROTOCOL_DETECT_PIN)
	{
	
    NRF_LOG_INFO("Reset!!");
	
    nrf_delay_ms(100);
		
		sd_softdevice_is_enabled(&is_softdevice_enabled);
		
		if (is_softdevice_enabled==1)
		{	
		  sd_nvic_SystemReset();
		}
		else
		{
      NVIC_SystemReset();
    }			

  }		
	
	
}	




/**@brief Initialization of unused I/Os
 */
static void misc_io_init(void)
{
    ret_code_t err_code; 
	  int i;
    uint32_t unused_pins[] = {0, 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 26, 27, 28, 29, 30, 31};  
    uint8_t  level;   

    for (i = 0; i < (sizeof(unused_pins) / sizeof(unused_pins[0])); ++i)
    {
        uint32_t pin = unused_pins[i];
        
        NRF_GPIO->PIN_CNF[pin] =
            (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Disconnect << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Disabled    << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);           
    }     
		
				//Set P0.03 as a protocol detect input pin, default GZLL, GND to BLE
		   NRF_GPIO->PIN_CNF[PROTOCOL_DETECT_PIN] =
		        (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Connect    << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Pullup      << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);
		
		level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
		
		if (!nrf_drv_gpiote_is_init())
    {
		   err_code = nrf_drv_gpiote_init();
       APP_ERROR_CHECK(err_code);
		}
		//Set P0.03 as a protocol detect input pin, VDD to GZLL, GND to BLE
		memset(&protocol_detect_pin_cfg, 0, sizeof(protocol_detect_pin_cfg));
		protocol_detect_pin_cfg.hi_accuracy = true;
	  
		protocol_detect_pin_cfg.sense = (level==M_COMS_BLE_MODE)? NRF_GPIOTE_POLARITY_LOTOHI : NRF_GPIOTE_POLARITY_HITOLO  ;
		protocol_detect_pin_cfg.pull  = (level==M_COMS_BLE_MODE)? NRF_GPIO_PIN_PULLDOWN : NRF_GPIO_PIN_PULLUP ;
		
		NRF_LOG_INFO("protocol detect pin toggled, level = %d", nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) );
		
		err_code = nrf_drv_gpiote_in_init(PROTOCOL_DETECT_PIN, &protocol_detect_pin_cfg, protocol_det_pin_handler);
		APP_ERROR_CHECK(err_code);
		
		nrf_drv_gpiote_in_event_enable(PROTOCOL_DETECT_PIN, true);
	
}			


/**@brief Function for application main entry.
 */
int main(void)
{
   bool erase_bonds;  
	
	  // Initialize.
    log_init();
	
	  misc_io_init();    //For protocol mode setting & unused pins	
	
	  m_protocol_mode = ((nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) == 0)?M_COMS_BLE_MODE:M_COMS_GZLL_MODE) ;
	
  	timers_init();	
	
    scheduler_init();

	  buttons_leds_init(&erase_bonds);

    modules_init();

    NRF_LOG_INFO("Dual mode keyboard example started.");
   	
	  modules_enable(erase_bonds);
	
	  application_timers_start();
		
		
	  

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
